#### IsComponentMirrored Property

---

|  |
| --- |
| DividedSurface Class   See Also |

Whether the pattern is mirror-imaged.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsComponentMirrored { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property IsComponentMirrored As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsComponentMirrored { 	bool get (); 	void set (bool value); } ``` |

# Remarks

This property has no effect unless a pattern is selected (the ObjectType property is not    a null reference (  Nothing  in Visual Basic)  ). Changing this flag effectively reflects the component through its YZ-plane.

# See Also

DividedSurface Class

Autodesk.Revit.DB Namespace